"""
Удаление дубликатов

Дан упорядоченный по неубыванию массив целых 32-разрядных чисел. Требуется
удалить из него все повторения.

Желательно получить решение, которое не считывает входной файл целиком в
память, т.е., использует лишь константный объем памяти в процессе работы.

# Формат ввода
Первая строка входного файла содержит единственное число n, n ≤ 1000000.

На следующих n строк расположены числа — элементы массива, по одному на строку.
Числа отсортированы по неубыванию.

# Формат вывода
Выходной файл должен содержать следующие в порядке возрастания уникальные
элементы входного массива.

# Пример
Ввод:
5
2
4
8
8
8

Вывод:
2
4
8
"""

import sys

list_of_numbers = []

number_of_numbers = sys.stdin.readline().strip()
tmp_number = -1

for _ in range(number_of_numbers):
    number = sys.stdin.readline().strip()

    if tmp_number != number:
        list_of_numbers.append(number)

    tmp_number = number

for number in list_of_numbers:
    print(number)