"""
Камни и украшения

Даны две строки строчных латинских символов: строка J и строка S.
Символы, входящие в строку J, — «драгоценности», входящие в строку S — «камни».

Нужно определить, какое количество символов из S одновременно являются
«драгоценностями». Проще говоря, нужно проверить, какое количество символов
из S входит в J.

# Формат ввода
На двух первых строках входного файла содержатся две строки строчных латинских
символов: строка J и строка S. Длина каждой не превосходит 100 символов.

# Формат вывода
Выходной файл должен содержать единственное число — количество камней,
являющихся драгоценностями.

# Пример
Ввод:
ab
aabbccd

Вывод:
4
"""

import sys

diamonds = sys.stdin.readline().strip()
stones = sys.stdin.readline().strip()

found_diamonds = 0

for stone in stones:
    for diamond in diamonds:
        if stone == diamond:
            found_diamonds += 1

print(found_diamonds)
