#!/bin/python3
# -*- coding: utf-8 -*-

"""
В этом задании мы с вами попробуем с помощью Python найти корни квадратного уравнения.

Напомним, что квадратное уравнение выглядит следующим образом:
ax^2 + bx + c = 0

На вход программе мы подадим коэффициенты a, b и c - ваша цель напечатать 2 корня квадратного уравнения 
(каждый с новой строки).

Если вы не помните формулу (а мы и сами ее не помним!), позволяющую найти корни такого уравнения, обратитесь за
помощью к статье в Википедии https://ru.wikipedia.org/wiki/Квадратное_уравнение.

Чтобы не усложнять вашу задачу все коэффициенты, которые мы будем подавать вам на вход являются коэффициентами,
которые в итоге дают 2 целых корня квадратного уравнения.

Коэффициенты a, b, c вы можете получить следующим образом:
import sys
a = int(sys.argv[1])
b = int(sys.argv[2])
c = int(sys.argv[3])

Вывод вашей программы для коэффициентов a = 1, b = -3, c = -4:
-1
4

Корни должны быть приведены к целочисленному виду перед выводом на экран, порядок вывода корней произвольный.
"""

import sys

a = int(sys.argv[1])
b = int(sys.argv[2])
c = int(sys.argv[3])

discr = b ** 2 - 4 * a * c

if discr > 0:
    x1 = (-b + discr ** 0.5) / (2 * a)
    x2 = (-b - discr ** 0.5) / (2 * a)
    print(int(x2))
    print(int(x1))
elif discr < 0:
    print(0)
else:
    x = -b / (2 * a)
    print(int(x))
